import React from "react";

export const IconCustomer = () => {
    return (
        <svg xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" width="20" height="20" viewBox="0 0 20 20">
            <defs>
                <clipPath id="clip-path">
                    <rect id="Rectangle_55" data-name="Rectangle 55" width="20" height="20" transform="translate(0 -0.112)" fill="#727c8c"/>
                </clipPath>
            </defs>
            <g id="Groupe_34" data-name="Groupe 34" transform="translate(0 0.112)" clipPath="url(#clip-path)">
                <g id="Groupe_19239" data-name="Groupe 19239" transform="translate(-0.554 -0.606)">
                    <path id="Tracé_32261" data-name="Tracé 32261" d="M8.454,10.252H8.385a.471.471,0,0,0-.156,0,4.466,4.466,0,1,1,.252,0Zm-.139-7.7a3.2,3.2,0,0,0-.122,6.4,1.445,1.445,0,0,1,.278,0,3.2,3.2,0,0,0-.156-6.4Z" transform="translate(-0.292)" fill="currentColor" stroke={"currentColor"}/>
                    <path id="Tracé_32262" data-name="Tracé 32262" d="M16.413,10.629a.24.24,0,0,1-.078-.009.687.687,0,0,1-.755-.573.633.633,0,0,1,.538-.72c.1-.009.217-.009.313-.009a2.389,2.389,0,0,0-.13-4.774.643.643,0,0,1-.651-.642A.656.656,0,0,1,16.3,3.25a3.691,3.691,0,0,1,.139,7.379Z" transform="translate(-1.844 -0.264)" fill="currentColor"/>
                    <path id="Tracé_32263" data-name="Tracé 32263" d="M8.171,21.216a8.575,8.575,0,0,1-4.7-1.3A3.725,3.725,0,0,1,1.6,16.832a3.764,3.764,0,0,1,1.866-3.1,9.191,9.191,0,0,1,9.41,0,3.745,3.745,0,0,1,1.866,3.082,3.764,3.764,0,0,1-1.866,3.1A8.6,8.6,0,0,1,8.171,21.216ZM4.187,14.827A2.5,2.5,0,0,0,2.9,16.841a2.49,2.49,0,0,0,1.285,2,7.844,7.844,0,0,0,7.969,0,2.5,2.5,0,0,0,1.285-2.014,2.49,2.49,0,0,0-1.285-2A7.885,7.885,0,0,0,4.187,14.827Z" transform="translate(0 -1.476)" fill="currentColor"/>
                    <path id="Tracé_32264" data-name="Tracé 32264" d="M18.242,19.759a.641.641,0,0,1-.634-.521.66.66,0,0,1,.5-.773,3.516,3.516,0,0,0,1.441-.634,1.549,1.549,0,0,0,.009-2.665,3.635,3.635,0,0,0-1.424-.634.654.654,0,1,1,.286-1.276,4.845,4.845,0,0,1,1.927.868,2.985,2.985,0,0,1,1.267,2.37,3.023,3.023,0,0,1-1.276,2.378,4.7,4.7,0,0,1-1.962.868A.406.406,0,0,1,18.242,19.759Z" transform="translate(-2.11 -1.582)" fill="currentColor"/>
                </g>
            </g>
        </svg>
    );
};
