import React from "react";

export const IconPinLocation = () => {
    return (
        <svg xmlns="http://www.w3.org/2000/svg" width="9.911" height="11.313" viewBox="0 0 9.911 11.313">
            <g id="Groupe_19256" data-name="Groupe 19256" transform="translate(-2.492 -1.125)">
                <path id="Tracé_32279" data-name="Tracé 32279" d="M10.12,10.416a1.988,1.988,0,1,1,1.99-1.985A1.992,1.992,0,0,1,10.12,10.416Zm0-3.2A1.219,1.219,0,1,0,11.339,8.43,1.221,1.221,0,0,0,10.12,7.211Z" transform="translate(-2.675 -2.521)" fill="#fff" stroke="#fff" strokeWidth="0.25"/>
                <path id="Tracé_32280" data-name="Tracé 32280" d="M7.446,12.313a3.071,3.071,0,0,1-2.124-.859C3.8,9.993,2.128,7.663,2.761,4.891A4.688,4.688,0,0,1,7.446,1.25h.005A4.688,4.688,0,0,1,12.136,4.9c.627,2.772-1.049,5.1-2.566,6.557A3.071,3.071,0,0,1,7.446,12.313Zm0-10.291a3.884,3.884,0,0,0-3.929,3.04c-.555,2.422.967,4.51,2.345,5.832a2.276,2.276,0,0,0,3.173,0c1.373-1.322,2.9-3.41,2.35-5.832A3.9,3.9,0,0,0,7.446,2.021Z" transform="translate(0)" fill="#fff" stroke="#fff" strokeWidth="0.25"/>
            </g>
        </svg>

    );
};
