import React from "react";
import {IconProps} from "./shared/IconProps";

export const IconPartner = ({className}:IconProps) => {
    return (
        <svg
            xmlns="http://www.w3.org/2000/svg"
            width="24"
            height="24"
            viewBox="0 0 24 24"
            fill="currentColor"
            className= {className}
        >
            <g
                id="Groupe_8505"
                data-name="Groupe 8505"
                transform="translate(-1248 -374)"
            >
                <g
                    id="Groupe_8324"
                    data-name="Groupe 8324"
                    transform="translate(-39)"
                >
                    <rect
                        id="Rectangle_204"
                        data-name="Rectangle 204"
                        width="24"
                        height="24"
                        rx="4"
                        transform="translate(1287 374)"
                        fill="#e9fbf6"
                        opacity="0"
                    />
                </g>
                <g
                    id="Groupe_8328"
                    data-name="Groupe 8328"
                    transform="translate(1250 376)"
                >
                    <g
                        id="Groupe_8329"
                        data-name="Groupe 8329"
                        transform="translate(-1.286 -1.25)"
                    >
                        <path
                            id="Tracé_609"
                            data-name="Tracé 609"
                            d="M8.834,10.987H8.758a.51.51,0,0,0-.169,0,4.831,4.831,0,1,1,.272,0Zm-.15-8.329a3.461,3.461,0,0,0-.131,6.92,1.563,1.563,0,0,1,.3,0,3.462,3.462,0,0,0-.169-6.92Z"
                            transform="translate(-0.135 0)"
                            fill="#2a3950"
                        />
                        <path
                            id="Tracé_610"
                            data-name="Tracé 610"
                            d="M16.481,11.231a.26.26,0,0,1-.085-.009.744.744,0,0,1-.817-.62.685.685,0,0,1,.582-.779c.113-.009.235-.009.338-.009a2.584,2.584,0,0,0-.141-5.164.7.7,0,0,1-.7-.695.709.709,0,0,1,.7-.7,3.992,3.992,0,0,1,.15,7.981Z"
                            transform="translate(-0.853 -0.122)"
                            fill="#2a3950"
                        />
                        <path
                            id="Tracé_611"
                            data-name="Tracé 611"
                            d="M8.708,21.933a9.275,9.275,0,0,1-5.089-1.408A4.029,4.029,0,0,1,1.6,17.191a4.071,4.071,0,0,1,2.019-3.352,9.941,9.941,0,0,1,10.178,0,4.051,4.051,0,0,1,2.019,3.333A4.071,4.071,0,0,1,13.8,20.524,9.3,9.3,0,0,1,8.708,21.933ZM4.4,15.022A2.7,2.7,0,0,0,3.009,17.2,2.694,2.694,0,0,0,4.4,19.36a8.485,8.485,0,0,0,8.62,0,2.7,2.7,0,0,0,1.39-2.178,2.694,2.694,0,0,0-1.39-2.16A8.529,8.529,0,0,0,4.4,15.022Z"
                            transform="translate(0 -0.683)"
                            fill="#2a3950"
                        />
                        <path
                            id="Tracé_612"
                            data-name="Tracé 612"
                            d="M18.295,20.292a.693.693,0,0,1-.685-.563.714.714,0,0,1,.545-.836,3.8,3.8,0,0,0,1.559-.685,1.837,1.837,0,0,0,.826-1.446,1.821,1.821,0,0,0-.817-1.437,3.931,3.931,0,0,0-1.54-.685.707.707,0,0,1,.31-1.38,5.24,5.24,0,0,1,2.085.939,3.229,3.229,0,0,1,1.371,2.563,3.27,3.27,0,0,1-1.38,2.573,5.086,5.086,0,0,1-2.122.939A.439.439,0,0,1,18.295,20.292Z"
                            transform="translate(-0.976 -0.732)"
                            fill="#2a3950"
                        />
                    </g>
                </g>
            </g>
        </svg>
    );
};
