import React from "react";
import { IconProps } from "./shared/IconProps";
import {boolean} from "yup";

export const IconStatisticTwo = ({ isView }: {isView?:boolean}) => {
    return (
        <svg xmlns="http://www.w3.org/2000/svg" width={isView?"25": "40"} height={isView?"25": "40"} viewBox="0 0 40 40">
            <g id="Groupe_19512" data-name="Groupe 19512" transform="translate(-850 -920)">
                <rect id="Rectangle_4313" data-name="Rectangle 4313" width="40" height="40" transform="translate(850 920)" fill="none"/>
                <g id="Groupe_19487" data-name="Groupe 19487" transform="translate(-5643.01 -4325)">
                    <path id="Tracé_31970" data-name="Tracé 31970" d="M654.016,24.827h-7.051a1.405,1.405,0,0,1-1.4-1.4V13.906a3.525,3.525,0,0,1,3.516-3.516h4.93a1.405,1.405,0,0,1,1.4,1.4V23.413A1.409,1.409,0,0,1,654.016,24.827Zm-5.656-2.791h4.26V13.2h-3.535a.726.726,0,0,0-.726.726Z" transform="translate(5855.477 5251.615)" fill="#e44cf7"/>
                    <path id="Tracé_31971" data-name="Tracé 31971" d="M657.8,28.734h-7.051a1.406,1.406,0,0,1-1.4-1.4V9.366a3.525,3.525,0,0,1,3.516-3.516h2.828a3.525,3.525,0,0,1,3.516,3.516V27.338A1.422,1.422,0,0,1,657.8,28.734Zm-5.637-2.791h4.261V9.366a.727.727,0,0,0-.726-.726h-2.828a.727.727,0,0,0-.726.726V25.943Z" transform="translate(5858.729 5247.708)" fill="#e44cf7"/>
                    <path id="Tracé_31972" data-name="Tracé 31972" d="M661.586,23.356h-7.051a1.405,1.405,0,0,1-1.4-1.4V13.5a1.405,1.405,0,0,1,1.4-1.4h4.93a3.525,3.525,0,0,1,3.516,3.516V21.96A1.394,1.394,0,0,1,661.586,23.356Zm-5.656-2.791h4.26V15.616a.726.726,0,0,0-.726-.726h-3.535Z" transform="translate(5861.991 5253.086)" fill="#e44cf7"/>
                    <path id="Tracé_31973" data-name="Tracé 31973" d="M666.831,41.25H655.669c-10.1,0-14.419-4.316-14.419-14.419V15.669c0-10.1,4.316-14.419,14.419-14.419h11.163c10.1,0,14.419,4.316,14.419,14.419V26.831C681.25,36.934,676.934,41.25,666.831,41.25ZM655.669,4.041c-8.577,0-11.628,3.051-11.628,11.628V26.831c0,8.577,3.051,11.628,11.628,11.628h11.163c8.577,0,11.628-3.051,11.628-11.628V15.669c0-8.577-3.051-11.628-11.628-11.628Z" transform="translate(5851.76 5243.75)" fill="#e44cf7"/>
                </g>
            </g>
        </svg>



    );
};
